<html>
	
<body>

		
		
<b>
			Information sur la version actuelle du logiciel ...
		</b>

		
<hr>

		
		
<h1>Nouveaut&eacute;s</h1>


		
		
		

		
<p>
			2018 - Juin : Tailor la fonctionnalit&eacute; de perforation, bug fix pour le model editor
		</p>

		
		
		
<p>
			2018 - Mai : Am&eacute;lioration sur le Model editor, pour simplifier l'usage.
		</p>


		
		
		
<p>
			2018 - F&eacute;vrier : Am&eacute;lioration d'utilisation, TRADUCTION COMPLETE en allemand par freddy !! g&eacute;nial.
			Ajout de la fonction de cr&eacute;ation d'un carton vierge.
		</p>

		
		
<p>
			2017 - Mars : ajout du param&egrave;tre du r&eacute;pertoire de stockage dans l'installation
			, ajout de la possibilit&eacute; de mettre un script groovy dans la page principale.
		</p>

		
		
<p>
			2017 - Fevrier - Mars : RD - Model Editor, editeur de
			workflow de traitements, permettant sans d&eacute;veloppement de faire des
			transformations sur les fichiers midi, ou Book
		</p>

		
		
<p>
			2017 - Janvier Fevrier : Extension de reconnaissance de
			carton.
		</p>

		
		
<p>
			2016 - Octobre : Am&eacute;lioration ergonomiques (sauvegarde
			de pr&eacute;f&eacute;rences utilisateur)
			mise en ligne de l'aide d'abord en
			fran&ccedil;ais, avec une int&eacute;gration d'un navigateur internet
			Passage &agrave;
			markdown pour les pages.
		</p>
		
		
<p>
			2016 - Aout : Passage &agrave; Java 8 (bug fix pour swing)
		</p>

		
<p>
			2016 - Ajout d'une extension de perforation avec GRBL
			Punch
			permet l'utilisation et la perforation de carton sur marchine
			Arduino ayant
			le logiciel GRBL Punch.
		</p>

		
<p>
			fin 2014 - Debut 2015 : amelioration du rendu sonore ,
			ajout d'une envelope de volume pour l'attaque (plus beau pour les
			instruments de foire). Beaucoup d'am&eacute;lioration visuelle et
			d'utilisation.
			Attention, il faut supprimer le cache de sound font
			pour avoir le nouveau rendu SF2.
		</p>

		
<p>
			Juin 2014 : Ajout d'outil pour le montage de carton,
			am&eacute;lioration de
			performance sur le jeu (le d&eacute;marrage du jeu du carton
			est plus rapide).
			Ajout
			d'un transactionnel sur le contenu du carton,
			pour permettre le
			rafraichissement des autres panneaux + taille du
			carton ... etc ...
		</p>

		
<p>
			Mars 2014 : Fix sur l'outil de s&eacute;lection. Ameliorations
			sur le
			panneau de pr&eacute;sentation des instruments. Nouveau panneau
			d'import de fichier midi ou Kar.
		</p>
		
<p>
			Fevrier 2014 : Amelioration du panneau de saisie de
			param&egrave;tres en groovy,
			ajout de la possibilit&eacute; de mettre une librairie
			.jar disponible pour les
			scripts dans
			le r&eacute;pertoire aprintstudio. Cela
			permet d'utiliser d'autres code java
			dans le d&eacute;veloppement
			de scripts.
			(export DXF par exemple).
		</p>
		
<p>
			Ajout de deux boutons "basiques", measure et pan. &ccedil;a
			aidera les d&eacute;butants
			:-)
		</p>
		
<p>
			Janvier 2014 : Beaucoup d'am&eacute;liorations vis &agrave; vis des
			possibilit&eacute;s de transformation de cartons ou de manipulation de
			fichiers midi par script,
			une premi&egrave;re DSL est mise en place pour
			faciliter grandement la
			transformation de fichier midi, ou conversion
			vers book.
			quelques
			lignes de script suffisent maintenant pour
			effectuer des conversions
			ou des modifications.
			Toutes les
			modifications n'ont pas forcement ete consign&eacute;es, mais le resultat
			sera surement pr&eacute;sent&eacute; sous forme de script ou tutoriels.
		</p>
		
<p>
			Janvier 2013 : Ajout des mesures dans l'impression de
			pon&ccedil;ifs.
		</p>
		
<p>
			Juillet 2012 : Simplification de la gestion des
			instruments
			, un nouveau panneau beaucoup plus ergonomique. Ajout d'un
			affichage
			de barres d'outils dans la vue carton (simplifier la
			vue).Acces pour
			les extension
			&agrave; la liste des problemes, cela permet de
			proposer des extensions
			permettant
			d'aller plus loin dans le controle
			d'erreurs. Egalement la
			possibilit&eacute; pour les extensions de r&eacute;aliser
			des "toolwindow",
			fenetres dockables sur les cot&eacute;s pour la vue carton.
			Ajout de composant de s&eacute;lection simple d'instrument.
			ajout d'un
			bibliotheque de composants visuels, pour aller plus loin.
			Fix sur un
			bug dans le cadre de d&eacute;veloppement d'extension (lecture par fichier
			du fichier .extension.properties).
			Passage vers de multiples fen&ecirc;tres
			pour les utilisateurs de MacOS.
			Les extensions peuvent maintenant
			proposer des librairies natives, ceci
			a &eacute;t&eacute; test&eacute; sur l'acc&egrave;s &agrave; des
			biblioth&egrave;ques de port s&eacute;rie.
		</p>
		
<p>
			Avril 2012: Ajout des mesures dans le logiciel,
			changements dans le format
			de stockage des cartons virtuels pour le
			stockage des annotations ou des changements de tempos
			Amelioration de
			la localisation sur le carton avec le CTRL+Roulette qui centre sur
			l'endroit point&eacute;. Fix sur l'outil de modification de trous.
		</p>
		
<p>
			Mars 2012 : Documentation, Documentation, Documentation
			...
			Quelques am&eacute;lioration sur l'utilisation + Bug Fixs.
			Tentative de
			mettre en place une restitution sonore particuli&egrave;re pour les
			percussions. (encore qq pbs de restitution &agrave; voir).
			Ajout des erreurs
			de lecture MIDI dans la liste des erreurs.
			Am&eacute;liorations Ergonomiques.
			Ameliorations significatives sur l'&eacute;diteur d'&eacute;chantillons (wav)
		</p>

		
<p>
			Fevrier 2012 :Ajout du support d'un syst&egrave;me de pilotage
			non midi (par prise s&eacute;rie ou autre). Point d'extension, permettant &agrave;
			un tier
			de d&eacute;velopper son syst&egrave;me de pilotage pour son instrument.
			Bug
			fix sur le renommage de fichier pour les machintosh (les fichiers
			temporaires sont sur un autre filsystem).
			Ajout support drag and drop
			pour les quickscripts.
		</p>

		
<p>
			Decembre 2011 : Bug fixes, Ajout du drag and drop pour
			les fichiers book et instrumentbundle. Am&eacute;lioration sur le feed back
			d'indexation et de recherche + ouverture des fichiers book.
			Augmentation du nombre de canaux utilisables directement (+de 16)
			et
			jusqu'&agrave; 64. Les instruments &agrave; plus de 10 registres sont maintenant
			restituables.
		</p>
		

		
<p>
			Novembre 2011 : Bug fixes, adaptation de quelques objets
			pour &eacute;tendre l'utilisation des extensions
		</p>
		

		
<p>
			Septembre 2011 : Amelioration Qualit&eacute;, (les utilisateurs
			aiment bien :-)
		</p>

		

		
<p>
			Aout 2011, ajout icone sur les fenetres, dans le
			menu on
			peut maintenant s&eacute;lectionner la langue (si la traduction
			n'est pas
			exacte). Augmentation de la qualit&eacute;. Am&eacute;lioration dans les fonction
			de scripting
		</p>


		
<p>
			Juillet 2011, Ajout de la sauvegarde et de la d&eacute;finition
			de la couverture du
			carton
		</p>

		
<p>
			Juin 2011, simplification de la cr&eacute;ation d'extensions
			logicielles
			(documentation + classes associ&eacute;es),
			Suppression du double
			clic sur les outils &agrave; deux &eacute;tats dans le carton virtuel.
		</p>
		
<p>
			mai 2011, ajout de quelques secondes sur l'export video
			pour permettre
			une fin moins abrupte. Bug Fixs, grandes am&eacute;lioration
			dans la capacit&eacute; de r&eacute;alisation d'instruments tr&egrave;s r&eacute;alistes dans le
			jeu (ajout des percussions dans la description de l'instrument).
			am&eacute;lioration de la documentation, plusieurs articles et rubriques ont
			&eacute;t&eacute; modifi&eacute;s et ajout&eacute;e.
		</p>
		
<p>
			Avril 2011 : Bug Fixs, ajout d'un bouton de revalidation
			des erreurs
			dans la vue carton. Ajout des documentation groovy dans
			l'installation et la documentation en ligne. Ajout d'un bouton dans
			l'editeur de gamme pour ajouter des notes en s&eacute;rie. Correction d'un
			bug de jeu lorsqu'il y a beaucoup de sons associ&eacute; &agrave; l'instument.
			on
			peut maintenant sereinement mettre un son par tuyau :-)
		</p>
		

		
<p>
			Mars 2011 : Bug Fixs, corrections diverses d'olivier
			(pas
			encore fini :-)). Am&eacute;lioration sur le support Midi dans le
			jeu.
			Ajout support fenetres flottantes/dockable pour simplifier l'ecran.
		</p>

		

		
<p>
			F&eacute;vrier 2011 : Correction sur la r&eacute;cup&eacute;ration du nom du
			morceau dans un fichier book. Percussions en fran&ccedil;ais. Fixs
			sur les
			outils de transposition Groovy. Deux nouveaux skins
			pour aprint. Ajout
			de deux fonction dans l'&eacute;diteur de gamme
			pour ajouter et supprimer une
			piste. Bug Fix sur la
			sauvegarde au format texte des erreurs.
		</p>

		

		
<p>
			Janvier 2011: bug fix sur l'arret du jeu dans la vue carton,
			fix sur
			les percussion dans la cr&eacute;ation de video
			<br>
			Inclusion des sources du programme dans le fichier .jar,
			modification
			de l'installation pour proposer la
			documentation developpeur.
		</p>
		

		
<p>
			Decembre 2010: Fix sur la registration, Ajout d'un calc
			pour
			visualiser la registration. Ajout d'un moteur de recherche
			pour
			rechercher plus facilement un fichier book. Ajout de
			propri&eacute;t&eacute;s sur le
			carton virtuel pour donner les indications
			(arrangeur, auteur , nom
			..). Correction d'un probleme de
			percussion sur le jeu de fichier
			book.
		</p>
		

		
<p>
			27 Novembre 2010 : Ajout d'un type de script "export"
			pour
			APrint, pour faciliter l'export ou le jeu pour des
			instrument midi
			qui ont des commandes particuli&egrave;res.(non
			termin&eacute; pour l'instant).
		</p>

		

		
<p>
			14 Novembre 2010 : Acces quickscript directement dans la
			vue
			carton. Ajout d'import / exports d'instruments dans l'outil
			de
			gestion d'instruments
		</p>

		

		
<p>
			7 Novembre 2010 : Ajout des param&egrave;tre de connection dans
			l'&eacute;diteur de repository, bug fix rafraichissement pinao dans
			l'editeur d'instrument. Simplification de la lecture
			d'erreur dans la
			console, maintenant la ligne de script est
			affich&eacute;e.
		</p>

		


		
<p>
			13 Octobre 2010 : Am&eacute;lioration de la qualit&eacute; cot&eacute;
			editeur de
			gamme.
		</p>

		


		
<p>
			9 Octobre 2010 : Ajout quick scripts pour les scripts
			associ&eacute;s au carton virtuel, mise en place d'un choix sur les
			calques
			du carton (menu)
		</p>

		


		
<p>
			Octobre 2010 : Am&eacute;lioration de certains &eacute;crans, pour
			&ecirc;tre
			plus simples &agrave; utiliser, ajout d'un panneau de bienvenue
			pour
			acc&eacute;der aux fonctions essentielles en un clic.
		</p>

		

		

		
<p>
			September 2010 : am&eacute;lioration du scripting (execution
			asynchrone), am&eacute;lioration de l'interface homme machine &agrave;
			beaucoup
			d'endroits. Ajout d'un outil de modification
			d'instrument dans les
			diff&eacute;rents repository. Celui ci est
			plus simple &agrave; comprendre que les
			diff&eacute;rentes options de
			menu. Il manque encore quelques fonctionnalit&eacute;s
			dans cet
			endroit.
		</p>


		

		
<p>
			Aout 2010 : am&eacute;lioration du scripting pour permettre
			l'acc&egrave;s
			&agrave; APrint. Ajout d'un acc&egrave;s script dans la vue carton.
		</p>

		

		
<p>
			Juillet 2010 : Corrections de bugs, ajout du support de
			script Groovy pour les transformations de fichier midi,
			cartons, ajout
			de scripts d'import &agrave; partir de midi,
			associ&eacute;s &agrave; l'instrument. (pour
			permettre l'import ais&eacute; de
			multiples fichiers midi diff&eacute;rents)
		</p>


		

		
<p>
			Juin 2010 : Ajout d'un export vers fichier video.
			Refactorisation de l'&eacute;diteur de gamme, plus simple plus
			ouvert.
			Amelioration du rendu de type papier (en lecture
			pneumatique).Ajout
			d'un bouton d'export des probl&egrave;mes dans
			un fichier texte.
		</p>


		

		
<p>
			Mai 2010 : correction sur l'Output Midi, correction d'un
			bug
			sur le chargement d'un fichier wav, ameliorations mineures
			d'&eacute;crans
		</p>

		

		
<p>
			Mai 2010 : ajout du bouton du milieu pour faire des
			d&eacute;placements dans le carton, changement couleur de la couche
			temps.
			Sous syst&egrave;me pour le jeu sur une carte midi (USB ...
			). Correction sur
			les accents dans la d&eacute;finition des gammes.
		</p>


		

		
<p>
			Avril 2010 : Q/A, et ajout d'une fonction de recherche
			d'instrument, ajout de l'import des gammes midiboek dans
			l'editeur
			d'instruments.
		</p>

		

		
<p>
			26 Mars : reduction des grands menu d'impression de
			gamme en
			petits menus + raccourcis claviers + confirmation dans
			l'editeur d'instrument
		</p>

		

		
<p>
			13 Mars : Am&eacute;lioration de la qualit&eacute; du logiciel
		</p>


		

		
<p>
			F&eacute;vrier - Mars : Correction du divers bugs et
			amelioration
			sur la cr&eacute;ation d'instrument (mode loop + ajout
			d'&eacute;chantillons en masse ... etc ...)
		</p>

		
<p>
			10 - Janvier, Am&eacute;lioration de quelques fonctionnalit&eacute;s.
		</p>

		


		
<p>
			23 - Janvier, Ajout d'un feedback lorsque l'utilisateur
			click sur une erreur dans le panneau d'erreurs.
		</p>


		


		
<p>
			2 - Janvier, am&eacute;lioration sur la gestion des fichiers de
			son
			en interne pour ne pas dupliquer les fichiers et g&eacute;rer des
			r&eacute;f&eacute;rences partag&eacute;es de fichier son wav. Ajout d'un scroll
			sur
			l'&eacute;diteur de wav.
		</p>

		

		
<p>
			1 - Janvier ,Correction d'un bug posant probl&egrave;me sur la
			restitution d'un instrument lorsque celui ci contient un
			grand nombre
			d'&eacute;chantillons + am&eacute;liorations diverses sur
			l'IHM.
		</p>

		

		
<p>
			27 - Decembre, Phase d'optimisation des structures
			internes.
			La rapidit&eacute; de chargement a &eacute;t&eacute; amelior&eacute; de fa&ccedil;on
			significative. Correction d'un bug dans le panneau
			d'attente, lorsque
			les op&eacute;rations sont rapides.
		</p>
		

		
<p>
			25 - Decembre, Finalisation repository Web + Edition
			Local
			d'instrument avec m&eacute;canisme de synchronisation. (pour
			permettre
			de faciliter la contribution sur les instruments)
		</p>
		

		
<p>
			13 - Decembre, Ajout de tous les instruments
			independemment
			de l'origine de la d&eacute;finition de l'instrument.
			Pr&eacute;sentation
			des instruments sous forme de cover flow.
		</p>
		

		
<p>
			1 - Decembre, corrections de bugs interne sur
			l'allocation
			de fichiers temporaires. Ajout d'une fonction d'export de
			gamme sous forme de fichier image.
		</p>
		

		
<p>
			14 -Novembre 2009, amelioration sur l'editeur
			d'instrument...
			<br>
			Ajout d'une fonction d'import / export dans le menu fichier.
		</p>
		

		
<p>
			13 -Novembre 2009, amelioration des &eacute;crans ...

			Ajout d'icones dans
			l'editeur d'instrument, creation de
			menus pertinents, localisation ...
			<br>
			Ajout d'un outil pour creer des patchs &agrave; partir d'un gros
			wav ..
			(facilite grandement l'utilisation d'un fichier
			monolytique contenant
			la gamme compl&egrave;te en Wav)
		</p>
		

		
<p>
			12 -Novembre 2009, bug fixes ...
			<br>
			
<ul>
				
<li>
					Corrections sur l'&eacute;diteur de gamme (pb d'attribution
					sur les
					pistes)
				</li>
				
<li>
					Internationalisation des chaines dans l'interface
					d'edition
					d'instrument
				</li>
				
<li>
					Ajout d'un filtre sur les images dans l'editeur
					d'instrument
				</li>
				
<li>
					Envoi de rapport de bugs en asynchrone
					(l'utilisateur n'est plus
					g&ecirc;n&eacute;)
				</li>
			
</ul>

		
</p>
		

		
<p>
			11 -Novembre 2009, Ajout d'outil dans d'&eacute;diteur de wav
			pour
			d&eacute;couper les sons. Ajout de boutons suppl&eacute;mentaires pour
			faciliter l'utilisation
		</p>
		

		
<p>
			25 - Octobre 2009, travail sur l'editeur d'instrument.
			Augmentation de la performance d'affichage du composant de
			gamme.
			Ajout de feedbacks sur l'interaction entre le piano
			et la gamme de
			l'instrument. Ajout d'un &eacute;tat "d&eacute;sactiv&eacute;" sur
			les touches du piano ne
			faisant pas partie de la gamme.
		</p>
		


		
<p>
			24 - Octobre 2009, ajout d'une pr&eacute;visualisation de
			l'&eacute;diteur
			d'instrument (toujours en cours de construction).
		</p>
		

		

		
<p>
			Octobre - Bug Fixes / dans le chargement de fichiers
			midi,
			certaines notes dupliqu&eacute;es dans diff&eacute;rentes pistes pouvant
			poser
			probl&egrave;me lors de la conversion en carton. Ce probl&egrave;me
			est maintenant
			corrig&eacute;. Debut de r&eacute;daction de la
			documentation en ligne du logiciel.
		</p>

		
		
<p>
			Septembre - Diverses corrections. retour &agrave; une
			impression en
			72 dpi, sur certaines imprimantes, il y a un pb.
		</p>

		
		
<p>
			22 Aout 2009 - Ajout d'un menu permettant de changer les
			couleurs de la fenetre, si le look "mac" ne convient pas
		</p>


		
		
<p>Aout 2009 - Correction de bugs</p>


		
		
<p>
			Aout 2009 - Ajout d'une traduction pour les jeux de
			tuyaux
			et des percussions. Mise en place sur le web d'un index
			traduit
			des diff&eacute;rentes gammes
		</p>

		

		
<p>
			Aout 2009 - Une nouvelle fonction dans le menu option,
			permettant de simplifier l'installation et la mise &agrave; jour de
			diff&eacute;rentes extensions. L'aide en ligne est maintenant dans
			deux
			langues (Fran&ccedil;ais et Anglais). La traduction dans les
			deux langues de
			l'apropos ici pr&eacute;sent (pour le papa
			d'olivier :-)).
		</p>

		
		
		
		

		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
<h1>Contact</h1>

		

		
<p>
			Vous pouvez nous contacter &agrave; cette adresse mail :
			<a href="mailto:frett27@free.fr">frett27@free.fr</a>
		
</p>


		
<h1>APrint License</h1>

		
<center>
			
<b>APrint - Copyright (C) Patrice Freydiere 2005-2008</b>
		
</center>

		
<pre>
			This library is free software; you can redistribute it
			and/or
			modify it under the terms of the GNU General Public
			License as
			published by the Free Software Foundation; either
			version 2 of the
			License, or (at your option) any later
			version.



			This library is
			distributed in the hope that it will be
			useful, but WITHOUT ANY
			WARRANTY; without even the implied
			warranty of MERCHANTABILITY or
			FITNESS FOR A PARTICULAR
			PURPOSE. See the GNU General Public License
			for more
			details.


			You should have received a copy of the GNU General
			Public
			License along with this library; if not, write to the Free
			Software Foundation, Inc., 59 Temple Place - Suite 330,
			Boston, MA
			02111-1307, USA.
		</pre>


		
<h2>
			This software include Liquid Look And Feel - under LGPL
			License
		</h2>

		
<h2>This software include Gervill, under GPL License</h2>

	
</body>

</html>
